feat: 8.3 Skills Manager
